<!DOCTYPE html >
<html>
<head>
<meta charset="utf-8">
<title>New Canadiana :: Babel - Alphabeta</title>
<link rel="canonical" href="https://weirdcanada.com/posts/new-canadiana-babel-alphabeta" />
</head>
<body>
<div class="contentContainer">
<div class="contentImage"><img class="aligncenter" src="http://weirdcanada.com/wp-content/uploads/2012/10/Babel-Alphabeta-Web-300x288.png" alt="Babel - Alphabeta" /></div>
<div class="contentInfo">
<ul>
<li class="contentArtist">Babel</li>
<li class="contentTitle">Alphabeta</li>
<li class="contentPublisher">(<a href="http://arachnidiscs.wordpress.com/" target="_blank">Arachnidiscs</a>)</li>
<li class="contentCity">Toronto, ON</li>
<li class="contentWebSounds"><a href="http://arachnidiscs.wordpress.com/music/" target="_blank">::web/sounds::</a></li>
</ul>
</div>
</div>
<div class="contentReview">
<ul id="languageTab" class="nav nav-tabs">
<li class="active"><a href="#english-1470953048513" data-toggle="tab">english</a></li>
<li><a href="#francais-1470953048513" data-toggle="tab">fran&ccedil;ais</a></li>
</ul>
<div id="languageTabContent" class="tab-content">
<div id="english-1470953048513" class="tab-pane fade in active">
<p class="contentAuthor">From the glass museum of <a href="http://pleasencerecords.tumblr.com/" target="_blank">James Lindsay</a>:</p>
Jakob Rehlinger (a.k.a. <a href="http://weirdcanada.com/2012/03/new-canadiana-moonwood-river-ghosts/" target="_blank">Moonwood</a> and proprietor of Arachnidiscs) has to be one of the most ambitious and prolific conceptual composers in Canada today. <em>Alphabeta</em>, his third release of 2012 and second under the Babel moniker, is an experiment in translating musical notation to words to actual music. By creating a sort of musical Boggle, he, for example, finds a path for the notes A, C, D, E, G to spell C-A-G-E-D, and following that staff, produces a spiritual tribute to <a href="http://youtu.be/i5ssRFrgF2k" target="_blank">the composer</a>. The liner notes include brief biographies of all 17 (!) pieces, written in a charmingly self-conscious tone, where he worries abut whether he is just chasing a gimmick, praises the creative stimulus of working under such strict constraints, and namedrops some artists who lent inspiration to the album&rsquo;s <a href="http://youtu.be/Bdblc_OMAA8" target="_blank">post-rock sound</a> (Cage, Swans, Rhys Chatham, Tortoise, etc). <em>Alphabeta</em> is impressive not only because Rehlinger succeeds in his experiment, but by clocking in at just under an hour with every piece feeling fully realized, the sheer epic scope is a dizzying triumph onto itself.</div>
<div id="francais-1470953048513" class="tab-pane fade">
<p class="contentAuthor">Du mus&eacute;e de verre de <a href="http://pleasencerecords.tumblr.com/" target="_blank">James Lindsay</a>: (<em>Traduit par Maya Keshav</em>)</p>
Jakob Rehlinger (alias <a href="http://weirdcanada.com/2012/03/new-canadiana-moonwood-river-ghosts/" target="_blank">Moonwood</a> et le propri&eacute;taire d&rsquo;Arachnidiscs) devrait &ecirc;tre un des compositeurs conceptuels les plus ambitieux et prolifiques au Canada aujourd&rsquo;hui. <em>Alphabeta</em>, son troisi&egrave;me morceau de 2012 et le deuxi&egrave;me sous le nom de Babel, est un essai dans la traduction de la notation musicale en les mots en la musique. En cr&eacute;ant une sort de Boggle musical, il trouve, par example, un chemin pour les notes A, C, D, E, G pour &eacute;peler C-A-G-E-D, et avec cette m&eacute;lodie, il produit un hommage spirituel au <a href="http://youtu.be/i5ssRFrgF2k" target="_blank">compositeur</a>. Les textes sur la jaquette incluent les courtes biographies pour tous les 17 (!) morceaux, &eacute;crites avec un ton d&eacute;licieusement g&ecirc;n&eacute;, o&ugrave; il s&rsquo;inqui&egrave;te pour la possibilit&eacute; qu&rsquo;il ne pourchasse qu&rsquo;un gadget, o&ugrave; il fait l&rsquo;&eacute;loge du stimulus cr&eacute;atif de travailler avec les contraintes si lourdes, et o&ugrave; il balance les noms connus de quelques artistes qui lui ont donn&eacute; de l&rsquo;inspiration pour les <a href="http://youtu.be/Bdblc_OMAA8" target="_blank">sons post-rock</a> de l&rsquo;album (Cage, Swans, Rhys Chatham, Tortoise, etc). <em>Alphabeta</em> est impressionnant non&nbsp;seulement parce que Rehlinger r&eacute;ussit avec son essai, mais gr&acirc;ce &agrave; la duration (moins d&rsquo;une heure) et au fait que chaque morceau a l&rsquo;air d&rsquo;&ecirc;tre compl&egrave;tement r&eacute;alis&eacute;, l&rsquo;&eacute;norme &eacute;tendue est un triomphe vertigineux.</div>
</div>
</div>
<p><audio class="audioTrack" preload="none" controls="controls">
<source src="http://weirdcanada.com/binary/Weird_Canada-Babel-Dead.mp3" type="audio/ogg; codecs=&quot;vorbis&quot;" />
<source src="http://weirdcanada.com/binary/Weird_Canada-Babel-Dead.mp3" type="audio/mpeg; codecs=&quot;mp3&quot;" /></audio></p>
<p class="audioTrack"><a href="http://weirdcanada.com/binary/Weird_Canada-Babel-Dead.mp3" target="_blank">Babel - Dead</a></p>
<p><audio class="audioTrack" preload="none" controls="controls">
<source src="http://weirdcanada.com/binary/Weird_Canada-Babel-Babbage_Decade.mp3" type="audio/ogg; codecs=&quot;vorbis&quot;" />
<source src="http://weirdcanada.com/binary/Weird_Canada-Babel-Babbage_Decade.mp3" type="audio/mpeg; codecs=&quot;mp3&quot;" /></audio></p>
<p class="audioTrack"><a href="http://weirdcanada.com/binary/Weird_Canada-Babel-Babbage_Decade.mp3" target="_blank">Babel - Babbage Decade</a></p>
</body>
</html></html>