<!DOCTYPE html >
<html>
<head>
<meta charset="utf-8">
<title>Departures :: The Stonefield - Deep Shades of Blue b/w Morning Hours [1967]</title>
<link rel="canonical" href="https://weirdcanada.com/posts/new-canadiana-the-stonefield-deep-shades-of-blue-bw-morning-hours" />
</head>
<body>
<div class="contentContainer">
<div class="contentImage"><img class="aligncenter" src="http://weirdcanada.com/wp-content/uploads/2012/03/stonefield-morning_hours-300x298.jpg" alt="" /></div>
<div class="contentInfo">
<ul>
<li class="contentArtist">The Stonefield</li>
<li class="contentTitle">Deep Shades of Blue b/w Morning Hours</li>
<li class="contentPublisher">(Luck Records)</li>
<li class="contentCity">Rycroft, AB</li>
<li class="contentWebSounds">Originally Released: 1967</li>
</ul>
</div>
</div>
<div class="contentReview">
<ul id="languageTab" class="nav nav-tabs">
<li class="active"><a href="#english-1470953048513" data-toggle="tab">english</a></li>
<li><a href="#francais-1470953048513" data-toggle="tab">fran&ccedil;ais</a></li>
</ul>
<div id="languageTabContent" class="tab-content">
<div id="english-1470953048513" class="tab-pane fade in active">
<p class="contentAuthor">From the mourning hours of <a href="http://weirdcanada.com/" target="_blank">Aaron Levin</a>:</p>
Hailing from one of the most northernly outposts in Canada, The Stonefield remain an enigma within the Canadian garage-punk cosmos. An easy personal favorite and serious head-scratcher with its brutal fuzz massacre, dual piano weirdness, and bewildering A/B-side pairing. "Deep <a href="http://www.youtube.com/watch?v=3dQY6dq_v1M" target="_blank">Shades of Blue</a>" oozes an addictive, lysergic weariness with its mid-tempo somber organ stuck firmly in a minor-key while their drummer, seemingly in his own universe, augments the pacing with a complete disregard for <a href="http://www.youtube.com/watch?v=eEp7LIzmtVU&amp;feature=related" target="_blank">drum pattern awareness</a>. "Morning Hours", the track that has grippers sweating this single pretty hard, is equally confusing, with a relentless bawdy piano swirling beneath the primitive fuzz lead, secondary organ (two keyboards?!), and <a href="http://www.youtube.com/watch?v=MULexjqrYww&amp;feature=related" target="_blank">bleary vocals</a> (singer Joe Verheyden has stated that he had a flu the day they recorded). The pi&egrave;ce de r&eacute;sistance hits mid-way through "Morning Hours" when one of the most intense and ridiculous fuzz-guitar solos totally drowns out the entire track. I once drove to <a href="http://www.discoverthepeacecountry.com/htmlpages/rycroft.html" target="_blank">The Hub of the Peace</a> (Rycroft) on a mission to uncover the mystery behind the band and their insanely obscure 7" to little success. They recorded in Edmonton and later reformed as The Exit, leaving the rest of the world to ponder the sheer awesomeness and absurdity of their legacy. I'd like to dedicate this post to my very close friend <strong>Jon Murphy</strong> who has brought a much needed light to many unknown 60s singles throughout Canada, including The Stonefield.</div>
<div id="francais-1470953048513" class="tab-pane fade">
<p class="contentAuthor">Des heures de deuil d&rsquo;<a href="http://weirdcanada.com/" target="_blank">Aaron Levin</a>: (<em>Traduit par Maya Keshav</em>)</p>
Originaire d&rsquo;un des avant-postes les plus nord au Canada, The Stonefield restent un &eacute;nigme dans le cosmos du garage-punk canadien. C&rsquo;est facilement un pr&eacute;f&eacute;r&eacute; personnel ainsi qu&rsquo;un puzzle s&eacute;rieux avec son massacre fuzz brutal, sa bizarrerie de piano double, et son jumelage d&eacute;concertant des faces A et B. &ldquo;Deep <a href="http://www.youtube.com/watch?v=3dQY6dq_v1M" target="_blank">Shades of Blue</a>&rdquo; &eacute;mane une fatigue lysergique qui rend accro avec son orgue maussade mi-tempo coinc&eacute; firmement en mode mineur pendant que leur batteur, qui a l&rsquo;air d&rsquo;&ecirc;tre dans son propre univers, augmente le rythme avec un m&eacute;pris total pour la <a href="http://www.youtube.com/watch?v=eEp7LIzmtVU&amp;feature=related" target="_blank">conscience des patterns de batterie</a>. &ldquo;Morning Hours&rdquo;, le morceau qui fait suer les acheteurs de cet single, est aussi d&eacute;concertant, avec un piano paillard sans cesse qui tourbillonne sous le lead fuzz primitif, le deuxi&egrave;me orgue (deux claviers?!), et le <a href="http://www.youtube.com/watch?v=MULexjqrYww&amp;feature=related" target="_blank">chant brouill&eacute;</a> (le chanteur Joe Verheyden a dit qu&rsquo;il avait la grippe le jour qu&rsquo;ils ont enregistr&eacute;). Le summum est au milieu de &ldquo;Morning Hours&rdquo; quand un des solos fuzz-guitare les plus intenses et ridicules couvre compl&egrave;tement le morceau entier. Une fois j&rsquo;ai conduit &agrave; <a href="http://www.discoverthepeacecountry.com/htmlpages/rycroft.html" target="_blank">The Hub of the Peace</a> (Rycroft) en me donnant pour mission de d&eacute;voiler le myst&egrave;re derri&egrave;re le groupe et leur 7&rdquo; extr&ecirc;mement obscure, avec aucun succ&egrave;s. Ils ont enregistr&eacute; &agrave; Edmonton et plus tard ils ont r&eacute;form&eacute; en tant que The Exit, en laissant r&eacute;fl&eacute;chir le reste du monde sur la g&eacute;nialitude pure et l&rsquo;absurdit&eacute; de leur h&eacute;ritage. J&rsquo;aimerais d&eacute;dier ce poste &agrave; mon ami tellement proche <strong>Jon Murphy</strong> qui a apport&eacute; au jour plusieurs singles mal connus des ann&eacute;es 60 partout au Canada, y compris The Stonefield.</div>
</div>
</div>
<p><audio class="audioTrack" preload="none" controls="controls">
<source src="http://weirdcanada.com/binary/Weird_Canada-The_Stonefield-Morning_Hours.mp3" type="audio/ogg; codecs=&quot;vorbis&quot;" />
<source src="http://weirdcanada.com/binary/Weird_Canada-The_Stonefield-Morning_Hours.mp3" type="audio/mpeg; codecs=&quot;mp3&quot;" /></audio></p>
<p class="audioTrack"><a href="http://weirdcanada.com/binary/Weird_Canada-The_Stonefield-Morning_Hours.mp3" target="_blank">The Stonefield - Morning Hours</a></p>
<p><audio class="audioTrack" preload="none" controls="controls">
<source src="http://weirdcanada.com/wp-content/uploads/2012/03/02-Stonefield-Deep-Shades-of-Blue.mp3" type="audio/ogg; codecs=&quot;vorbis&quot;" />
<source src="http://weirdcanada.com/wp-content/uploads/2012/03/02-Stonefield-Deep-Shades-of-Blue.mp3" type="audio/mpeg; codecs=&quot;mp3&quot;" /></audio></p>
<p class="audioTrack"><a href="http://weirdcanada.com/wp-content/uploads/2012/03/02-Stonefield-Deep-Shades-of-Blue.mp3" target="_blank">Stonefield - Deep Shades of Blue</a></p>
</body>
</html></html>