<!DOCTYPE html >
<html>
<head>
<meta charset="utf-8">
<title>Wyrd MTL feat. NXNE - Merci Beaucoup b/w Thanks so much!</title>
<link rel="canonical" href="https://weirdcanada.com/posts/nxne-cbc3-wyrd-mtl-thanks" />
</head>
<body>
<div class="contentContainer">
<div class="contentImage"><img class="aligncenter" src="http://weirdcanada.com/wp-content/uploads/2011/06/Lantern.jpg" alt="" /></div>
<div class="contentInfo">
<ul>
<li class="contentArtist">Wyrd MTL feat. NXNE</li>
<li class="contentTitle">Merci beaucoup b/w Thanks so much!&nbsp;</li>
<li class="contentPublisher">(Self Released)</li>
<li class="contentCity">Montreal, QC // Toronto, ON</li>
<li class="contentWebSounds"><a href="http://weirdcanada.com" target="_blank">::web/sounds::</a></li>
</ul>
</div>
</div>
<div class="contentReview">
<ul id="languageTab" class="nav nav-tabs">
<li class="active"><a href="#english-wyrd-mtl-feat-nxne" data-toggle="tab">english</a></li>
<li><a href="#francais-wyrd-mtl-feat-nxne" data-toggle="tab">fran&ccedil;ais</a></li>
</ul>
<div id="languageTabContent" class="tab-content">
<div id="english-wyrd-mtl-feat-nxne" class="tab-pane fade in active">
<p class="contentAuthor">Lantern at Wyrd MTL [Photo:&nbsp;<a href="http://bruisedtongue.com/wordpress/" target="_blank">Pierre Richardson</a>]</p>
After the insanity of NXNE, our Searchlight acceptance / trophy-drinking bender and (wildest of all) Wyrd MTL, team WC has been in dire need of an Internet sabbatical. Seven days later, we&rsquo;re now rested and ready to resume our daily operations, but would first like to extend a formal &ldquo;Thank you!&rdquo; to everyone who made the weekend of June 18-20 one for the record books. The fine folks at <a href="http://www.flemisheye.com/" target="_blank">Flemish Eye</a> deserve major kudos for putting in all the hard work to throw a killer, sold out showcase at the Great Hall, while the stacked lineup was a banger from start to finish. Most importantly, thanks to the amazing fans that showed up to pack the venue to the rafters! Big ups to Grant Lawrence and the rest of the CBC Radio 3 crew for presenting us with our chalice, and bigger cheers to Sailor Jerry&trade; for filling it up afterwards. Finally, for everyone who traveled from near or far to be part of the first annual Wyrd MTL, we&rsquo;d like to deliver the biggest thanks of all. To all 10 incredible acts who blazed it up, the record labels and Raymond Biesinger holding it down at the Mega Merch Bazaar (next year: lamps!), the tireless sound guys at La Sala Rossa, our unflappable volunteers and door crew, the radio rockers from CKUT for live broadcasting the show, Mike and Pam for their continuing coverage on the <a href="http://thebillmurrayradioshow.blogspot.com/" target="_blank">Bill Murray Radio Show</a>, Rob Starrat for constructing our floor stage, <a href="http://www.casadelpopolo.com/suoniperilpopolo/" target="_blank">Suoni per Il Popolo</a> for graciously co-presenting the event, and all the audience members who came out to enjoy the show: merci encore! Can&rsquo;t wait to do it again next year&hellip;</div>
<div id="francais-wyrd-mtl-feat-nxne" class="tab-pane fade">
<p class="contentAuthor">Lantern &agrave; Wyrd MTL [Photo: <a href="http://bruisedtongue.com/wordpress/" target="_blank">Pierre Richardson</a>]: (<em>Traduit par Maya Keshav</em>)</p>
Apr&egrave;s l&rsquo;insanit&eacute; de NXNE, notre acceptation &agrave; Searchlight / la surprise d&rsquo;avoir bu un troph&eacute;e, et (la chose la plus folle) Wyrd MTL, l&rsquo;&eacute;quipe de WC avait vraiment besoin d&rsquo;un cong&eacute; sabbatique de l&rsquo;internet. Sept jours plus tard, on est repos&eacute; et pr&ecirc;t &agrave; reprendre nos op&eacute;rations quotidiennes, mais avant tout, on aimerait remercier officiellement tout le monde qui a contribu&eacute; au succ&egrave;s du weekend de 18-20 juin. Les gars sympathiques &agrave; Flemish Eye m&eacute;ritent un grand bravo pour avoir fait tellement beaucoup de travail pour cr&eacute;er une vitrine magnifique au Great Hall, et la programmation incroyable &eacute;tait une r&eacute;ussite de bout en bout. Et la chose la plus importante, merci aux fans qui sont venus pour remplir la salle jusqu&rsquo;au plafond! Un grand merci &agrave; Grant Lawrence et le reste de l&rsquo;&eacute;quipe CBC Radio 3 pour nous avoir remis notre calice, et tchin-tchin &agrave; Sailor Jerry&trade; pour l&rsquo;avoir remplir apr&egrave;s. Finalement, pour tout le monde qui a voyag&eacute; de pr&egrave;s ou de loin pour s&rsquo;impliquer dans le premier Wyrd MTL annuel, on aimerait saluer avec le plus grand merci. &Agrave; tous les 10 groupes incroyables qui se sont balan&ccedil;&eacute;s, les etiquettes et Raymond Biesinger qui manageaient le Mega Merch Bazaar (l&rsquo;ann&eacute;e prochaine: les lampes!), les techniciens du son infatigables &agrave; La Sala Rossa, nos b&eacute;n&eacute;voles imperturbables et l&rsquo;&eacute;quipe de porte, les super gens de la radio CKUT pour leur &eacute;mission en direct du spectacle, Mike et Pam pour leur reportage continue sur The Bill Murray Radio Show, Rob Starrat pour avoir construit notre sc&egrave;ne, Suoni per Il Popolo pour avoir co-pr&eacute;senter l&rsquo;&eacute;v&eacute;nement, et tous les membres du public qui sont venus pour le spectacle: merci encore! On a h&acirc;te de le faire encore l&rsquo;ann&eacute;e prochaine&hellip;</div>
</div>
</div>

</body>
</html></html>